<script>
import ImageDecor from "../components/ImageDecor.vue";
import About from "../components/About.vue";
import Video from "../components/Video.vue";
import Trainers from "../components/Trainers.vue";
import Skills from "../components/Skills.vue";
import TableAbout from "../components/TableAbout.vue";
import Form from "../components/Form.vue";

import Table from "../components/Table.vue";
import Map from "../components/Map.vue";

import Bg from "../assets/Header/Student.jpg";

import Run from "../assets/SkillIcon/Run.png";
import Winner from "../assets/SkillIcon/Winner.png";
import Frendly from "../assets/SkillIcon/Frendly.png";

import { useStore } from "vuex";
import { computed, onMounted } from "vue";

export default {
    components: {
        ImageDecor,
        About,
        Video,
        Trainers,
        Skills,
        Table,
        TableAbout,
        Map,
        Form,
    },
    setup() {
        const store = useStore();

        const about = {
            title: "Чему мы можем научить",
            msg: "Для игр мужских команд расстояние между лицевыми линиями должно быть 30 м, ширина поля 20 м. Для игр женских команд расстояние между лицевыми линиями должно быть 25 м, ширина поля 17 м. Границы игрового поля (лицевые линии) должны находиться на расстоянии 0,30 м за линиями ворот.По обе стороны игрового поля устанавливаются ворота. Ворота представляют собой две стойки и перекладину прямоугольной формы толщиной 0,075 м, обращённые в сторону игрового поля и окрашенные в белый цвет. Они должны быть установлены строго посередине линии ворот и на расстоянии не менее 0,30 м от границ игрового поля. Расстояние между стойками ворот должно быть 3 м. Если глубина бассейна составляет 1,8 м и более, как того требуют правила игры, то нижний край перекладины должен находиться на высоте 0,90 м над поверхностью воды (при игре любительских и профессиональных команд в бассейнах, в которых есть глубокая и мелкая часть, правилами предусмотрена установка ворот при глубине от 1,5 м и менее таким образом, чтобы перекладина отстояла от дна бассейна не менее чем на 2,4 м).",
        };
        const allVideo = [
            {
                id: 0,
                frame: '<iframe width="1056" height="594" src="https://www.youtube.com/embed/pQLGvi_byeg" title="Финал Азиады-2018 по водному поло. Япония - Казахстан" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>',
            },
            {
                id: 1,
                frame: '<iframe width="1056" height="594" src="https://www.youtube.com/embed/KbMlp7lZUtw" title="Документальный цикл «Жестокий Спорт». Водное поло" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>',
            },
        ];
        const aboutTrainers = {
            title: "Наши Тренера",
            msg: "Командный водный олимпийский вид спорта, целью в котором является забросить мяч в ворота соперника большее число раз, чем это сделает оппонент в установленное время. Игра проходит в воде, а мяч держат и забрасывают в ворота одной рукой. Прародителем водного поло можно считать японскую игру, суть которой заключалась в передаче мяча специальными шестами игрокам своей команды, находясь при этом на плаву на соломенных бочках. Современное водное поло было изобретено Уильямом Уилсоном во второй половине XIX века.",
        };

        const skills = [
            {
                icon: Run,
                msg: "Командный водный олимпийский вид спорта, целью в котором является забросить мяч в ворота соперника большее число раз, чем это сделает оппонент в установленное время. Игра проходит в воде, а мяч держат и забрасывают в ворота одной рукой. Прародителем водного поло можно считать японскую игру, суть которой заключалась в передаче мяча специальными шестами игрокам своей команды, находясь при этом на плаву на соломенных бочках.",
            },
            {
                icon: Winner,
                msg: "Командный водный олимпийский вид спорта, целью в котором является забросить мяч в ворота соперника большее число раз, чем это сделает оппонент в установленное время. Игра проходит в воде, а мяч держат и забрасывают в ворота одной рукой. Прародителем водного поло можно считать японскую игру, суть которой заключалась в передаче мяча специальными шестами игрокам своей команды, находясь при этом на плаву на соломенных бочках. .",
            },
            {
                icon: Frendly,
                msg: "Командный водный олимпийский вид спорта, целью в котором является забросить мяч в ворота соперника большее число раз, чем это сделает оппонент в установленное время. Игра проходит в воде, а мяч держат и забрасывают в ворота одной рукой. Прародителем водного поло можно считать японскую игру, суть которой заключалась в передаче мяча специальными шестами игрокам своей команды, находясь при этом на плаву на соломенных бочках.",
            },
        ];
        const tableAbout = {
            title: "Текст",
            msg: "Для игр мужских команд расстояние между лицевыми линиями должно быть 30 м, ширина поля 20 м. Для игр женских команд расстояние между лицевыми линиями должно быть 25 м, ширина поля 17 м. Границы игрового поля (лицевые линии) должны находиться на расстоянии 0,30 м за линиями ворот.По обе стороны игрового поля устанавливаются ворота. Ворота представляют собой две стойки и перекладину прямоугольной формы толщиной 0,075 м, обращённые в сторону игрового поля и окрашенные в белый цвет. Они должны быть установлены строго посередине линии ворот и на расстоянии не менее 0,30 м от границ игрового поля. Расстояние между стойками ворот должно быть 3 м. Если глубина бассейна составляет 1,8 м и более, как того требуют правила игры, то нижний край перекладины должен находиться на высоте 0,90 м над поверхностью воды (при игре любительских и профессиональных команд в бассейнах, в которых есть глубокая и мелкая часть, правилами предусмотрена установка ворот при глубине от 1,5 м и менее таким образом, чтобы перекладина отстояла от дна бассейна не менее чем на 2,4 м).",
        };
        const form = {
            title: "Как к нам попасть",
            msg: "Для игр мужских команд расстояние между лицевыми линиями должно быть 30 м, ширина поля 20 м. Для игр женских команд расстояние между лицевыми линиями должно быть 25 м, ширина поля 17 м. Границы игрового поля (лицевые линии) должны находиться на расстоянии 0,30 м за линиями ворот.По обе стороны игрового поля устанавливаются ворота. Ворота представляют собой две стойки и перекладину прямоугольной формы толщиной 0,075 м, обращённые в сторону игрового поля и окрашенные в белый цвет. Они",
            href: "sfdsg",
        };
        onMounted(async () => {
            await store.dispatch("actPage", "pageStudent");
        });
        return {
            store,
            pageStudent: computed(() => store.getters.getPageStudent),
            Bg,
            about,
            allVideo,
            aboutTrainers,
            skills,
            tableAbout,
            form,
        };
    },
};
</script>

<template>
    <section>
        <ImageDecor :img="Bg" />
        <About :about="about" />
        <Video :allVideo="allVideo" />
        <Trainers
            :aboutTrainers="aboutTrainers"
            :trainers="pageStudent.trainers"
        />
        <Skills title="Идеальный кандидат" :skills="skills" />
        <TableAbout :about="tableAbout" />
        <Table :groups="pageStudent.groups" />
        <Map :coords="[54.720657, 20.351297]" />
        <Form :form="form" />
    </section>
</template>

<style lang="scss" scoped>
section {
    position: relative;
}
</style>
