<script>
import About from "../components/About.vue";
import Carusel from "../components/Carusel.vue";
import Trainers from "../components/Trainers.vue";
import Table from "../components/Table.vue";
import Skill from "../components/Skill.vue";

import Img1 from "../assets/Amateur/1.jpg";
import Img2 from "../assets/Amateur/2.jpg";
import Img3 from "../assets/Amateur/3.jpg";
import Img4 from "../assets/Amateur/4.jpg";
import Img5 from "../assets/Amateur/5.jpg";
import Img6 from "../assets/Amateur/6.jpg";
import Img7 from "../assets/Amateur/7.jpg";
import Img8 from "../assets/Amateur/8.jpg";

import ImgSkill1 from "../assets/SkillDecor/1.png";
import ImgSkill2 from "../assets/SkillDecor/2.png";
import ImgSkill3 from "../assets/SkillDecor/3.png";

export default {
    components: {
        About,
        Carusel,
        Trainers,
        Table,
        Skill,
    },
    setup() {
        const about = {
            title: "Любители",
            msg: "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия.По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
        };

        const carusel = [Img1, Img2, Img3, Img4, Img5, Img6, Img7, Img8];

        const table = {
            title: "Занятия",
            msg: "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце,",
            class: [
                {
                    day: "Понедельник",
                    time: "-",
                },
                {
                    day: "Вторник",
                    time: "9.00-11.00",
                },
                {
                    day: "Среда",
                    time: "-",
                },
                {
                    day: "Четверг",
                    time: "-",
                },
                {
                    day: "Пятница",
                    time: "-",
                },
                {
                    day: "Суббота",
                    time: "-",
                },
                {
                    day: "Воскресенье",
                    time: "18.00-20.00",
                },
            ],
            mapCoords: [54.720657, 20.351297],
        };

        const skill = {
            title: "Идеальный кандидат",
            card: [
                {
                    msg: "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали ",
                    icon: ImgSkill1,
                },
                {
                    msg: "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали ",
                    icon: ImgSkill2,
                },
                {
                    msg: "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали ",
                    icon: ImgSkill3,
                },
            ],
        };

        return { about, carusel, table, skill };
    },
};
</script>

<template>
    <About :about="about" />
    <Carusel :carusel="carusel" />
    <Trainers />
    <Skill :skill="skill" />
    <Table :table="table" />
</template>

<style scoped></style>
