<script>
import ImageCarusel from "../components/ImageCarusel.vue";
import VideoCarusel from "../components/VideoCarusel.vue";

import arrow from "../assets/ArrowNews.png";

export default {
    components: {
        ImageCarusel,
        VideoCarusel,
    },
    setup() {
        return {
            arrow,
        };
    },
};
</script>

<template>
    <section>
        <h1>Заголовок</h1>

        <p>
            <ImageCarusel class="carusel" />
            Задача организации, в особенности же дальнейшее развитие различных
            форм деятельности влечет за собой процесс внедрения и модернизации
            модели развития. Задача организации, в особенности же начало
            повседневной работы по формированию позиции способствует подготовки
            и реализации системы обучения кадров, соответствует насущным
            потребностям. Значимость этих проблем настолько очевидна, что начало
            повседневной работы по формированию позиции требуют от нас анализа
            системы обучения кадров, соответствует насущным потребностям.
            Повседневная практика показывает, что консультация с широким активом
            требуют от нас анализа существенных финансовых и административных
            условий. Не следует, однако забывать, что новая модель
            организационной деятельности обеспечивает широкому кругу
            (специалистов) участие в формировании систем массового участия.
            Разнообразный и богатый опыт консультация с широким активом влечет
            за собой процесс внедрения и модернизации системы обучения кадров,
            соответствует насущным потребностям. Разнообразный и богатый опыт
            начало повседневной работы по формированию позиции в значительной
            степени обуславливает создание существенных финансовых и
            административных условий. Разнообразный и богатый опыт укрепление и
            развитие структуры .соответствует насущным потребностям. Значимость
            этих проблем настолько очевидна, что начало повседневной работы по
            формированию позиции требуют от нас анализа системы обучения кадров,
            соответствует насущным потребностям. Повседневная практика
            показывает, что консультация с широким активом требуют от нас
            анализа существенных финансовых и административных условий. Не
            следует, однако забывать, что новая модель организационной
            деятельности обеспечивает широкому кругу (специалистов) участие в
            формировании систем массового участия. Разнообразный и богатый опыт
            консультация с широким активом влечет за собой процесс внедрения и
            модернизации системы обучения кадров, соответствует насущным
            потребностям. Разнообразный и богатый опыт начало повседневной
            работы по формированию позиции в значительной степени обуславливает
            создание существенных финансовых и административных условий.
            Разнообразный и богатый опыт укрепление и развитие структуры .
            Задача организации, в особенности же дальнейшее р
        </p>
        <VideoCarusel />
    </section>
</template>

<style lang="scss" scoped>
section {
    padding: 1rem var(--px-block);

    h1 {
        text-align: center;
        padding: 2rem 0;
        font-size: var(--size-title);
        font-weight: bold;
        text-transform: uppercase;
    }
    p {
        font-size: var(--size-text);
        line-height: 1.2;
        padding-bottom: 1rem;
        .carusel {
            padding-left: 1rem;
            float: right;
            width: 50%;
        }
    }
}
@media screen and (max-width: 768px) {
    section {
        text-align: center;
        p {
            .carusel {
                padding-left: 0;
                padding-bottom: 1rem;
                float: none;
                width: 100%;
            }
        }
    }
}
</style>
