<script>
import About from "../components/About.vue";
import NewsCard from "../components/NewsCard.vue";

import { useStore } from "vuex";
import { computed, onMounted } from "vue";

export default {
    components: {
        About,
        NewsCard,
    },
    setup() {
        const store = useStore();

        const about = {
            title: "Новости",
            msg: "Для игр мужских команд расстояние между лицевыми линиями должно быть 30 м, ширина поля 20 м. Для игр женских команд расстояние между лицевыми линиями должно быть 25 м, ширина поля 17 м. Границы игрового поля (лицевые линии) должны находиться на расстоянии 0,30 м за линиями ворот.По обе стороны игрового поля устанавливаются ворота. Ворота представляют собой две стойки и перекладину прямоугольной формы толщиной 0,075 м, обращённые в сторону игрового поля и окрашенные в белый цвет. Они должны быть установлены строго посередине линии ворот и на расстоянии не менее 0,30 м от границ игрового поля. Расстояние между стойками ворот должно быть 3 м. Если глубина бассейна составляет 1,8 м и более, как того требуют правила игры, то нижний край перекладины должен находиться на высоте 0,90 м над поверхностью воды (при игре любительских и профессиональных команд в бассейнах, в которых есть глубокая и мелкая часть, правилами предусмотрена установка ворот при глубине от 1,5 м и менее таким образом, чтобы перекладина отстояла от дна бассейна не менее чем на 2,4 м).",
        };
        onMounted(async () => {
            await store.dispatch("actPage", "pageNews");
        });
        return {
            store,
            pageNews: computed(() => store.getters.getPageNews),
            store,
            about,
        };
    },
};
</script>

<template>
    <section>
        <About :about="about" />
        <NewsCard :pageNews="pageNews.news" />
    </section>
</template>

<style lang="scss" scoped></style>
