<script>
import About from "../components/About.vue";
import Video from "../components/Video.vue";
import Map from "../components/Map.vue";
import TableAbout from "../components/TableAbout.vue";
import Place from "../components/Place.vue";

export default {
    components: {
        About,
        Video,
        TableAbout,
        Map,
        Place,
    },
    setup() {
        const about = {
            title: "Сборы",
            msg: "Для игр мужских команд расстояние между лицевыми линиями должно быть 30 м, ширина поля 20 м. Для игр женских команд расстояние между лицевыми линиями должно быть 25 м, ширина поля 17 м. Границы игрового поля (лицевые линии) должны находиться на расстоянии 0,30 м за линиями ворот.По обе стороны игрового поля устанавливаются ворота. Ворота представляют собой две стойки и перекладину прямоугольной формы толщиной 0,075 м, обращённые в сторону игрового поля и окрашенные в белый цвет. Они должны быть установлены строго посередине линии ворот и на расстоянии не менее 0,30 м от границ игрового поля. Расстояние между стойками ворот должно быть 3 м. Если глубина бассейна составляет 1,8 м и более, как того требуют правила игры, то нижний край перекладины должен находиться на высоте 0,90 м над поверхностью воды (при игре любительских и профессиональных команд в бассейнах, в которых есть глубокая и мелкая часть, правилами предусмотрена установка ворот при глубине от 1,5 м и менее таким образом, чтобы перекладина отстояла от дна бассейна не менее чем на 2,4 м).",
        };
        const allVideo = [
            '<iframe width="1056" height="594" src="https://www.youtube.com/embed/pQLGvi_byeg" title="Финал Азиады-2018 по водному поло. Япония - Казахстан" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>',
            '<iframe width="1056" height="594" src="https://www.youtube.com/embed/KbMlp7lZUtw" title="Документальный цикл «Жестокий Спорт». Водное поло" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>',
        ];
        const tableAbout = {
            title: "Сколько стоит",
            msg: "Для игр мужских команд расстояние между лицевыми линиями должно быть 30 м, ширина поля 20 м. Для игр женских команд расстояние между лицевыми линиями должно быть 25 м, ширина поля 17 м. Границы игрового поля (лицевые линии) должны находиться на расстоянии 0,30 м за линиями ворот.По обе стороны игрового поля устанавливаются ворота. Ворота представляют собой две стойки и перекладину прямоугольной формы толщиной 0,075 м, обращённые в сторону игрового поля и окрашенные в белый цвет. Они должны быть установлены строго посередине линии ворот и на расстоянии не менее 0,30 м от границ игрового поля. Расстояние между стойками ворот должно быть 3 м. Если глубина бассейна составляет 1,8 м и более, как того требуют правила игры, то нижний край перекладины должен находиться на высоте 0,90 м над поверхностью воды (при игре любительских и профессиональных команд в бассейнах, в которых есть глубокая и мелкая часть, правилами предусмотрена установка ворот при глубине от 1,5 м и менее таким образом, чтобы перекладина отстояла от дна бассейна не менее чем на 2,4 м).",
        };
        return {
            about,
            allVideo,
            tableAbout,
        };
    },
};
</script>

<template>
    <section>
        <About :about="about" />
        <Video :allVideo="allVideo" />
        <Place/>
        <TableAbout :about="tableAbout" />
        <Map :coords="[54.720657, 20.351297]" />
    </section>
</template>
<style lang="scss" scoped></style>
