<script>
import AboutDecor from "../assets/AboutDecor.png";
export default {
    setup() {
        return {
            AboutDecor,
        };
    },
};
</script>

<template>
    <div>
        <h1>Великому городу, достойную команду</h1>
        <p>
            Командный водный олимпийский вид спорта, целью в котором является
            забросить мяч в ворота соперника большее число раз, чем это сделает
            оппонент в установленное время. Игра проходит в воде, а мяч держат и
            забрасывают в ворота одной рукой. Прародителем водного поло можно
            считать японскую игру, суть которой заключалась в передаче мяча
            специальными шестами игрокам своей команды, находясь при этом на
            плаву на соломенных бочках. Современное водное поло было изобретено
            Уильямом Уилсоном во второй половине XIX века. Сначала игра очень
            походила на регби, так как в первых редакциях правил было разрешено
            применять силу в борьбе за мяч и удерживать соперника. Кроме этого
            поле для игры в водное поло размечалось на неподвижном водоеме, а
            вместо ворот в дно водоема были вкопаны палки, выступающие на 30-40
            см над поверхностью воды. Игрокам было необходимо вплавь заносить
            мяч в ворота. в дно водоема были вкопаны палки, выступающие на 30-40
            см над поверхностью воды. Игрокам было необходимо вплавь заносить
            мяч в ворота.
            
        </p>
        <img style="left: 0" :src="AboutDecor" />
        <img style="right: 0; transform: scale(-1, 1)" :src="AboutDecor" />
    </div>
</template>

<style lang="scss" scoped>
div {
    position: relative;
    color: var(--color-primary);
    text-align: center;
    padding: 1rem 15%;
    line-height: 1.5;

    h1 {
        font-size: var(--size-title);
        margin-bottom: 1rem;
        font-weight: bold;
        text-transform: uppercase;
    }
    p {
        font-size: var(--size-text);
    }
    img {
        position: absolute;
        top: 0;
        width: 30%;
        max-height: 100%;
        opacity: 0.2;
    }
}
// @media screen and (max-width: 1368px) {
//     div {
//         padding: 1rem;
//         img {
//             display: none;
//         }
//     }
// }
</style>
